cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'

# Install binaries
brew 'htop'
brew 'wget'
brew 'git'
brew 'ncdu'                     # Usual disk measurement tool
brew 'homebrew/php/phpunit'     # phpunit
brew 'diff-so-fancy'            # Better formatting for diff's
brew 'gpg'                      # GPG Encryption
brew 'ansible@2'                # Ansible for bedrock/wordpress
brew 'acmetool'                 # Let's Encrypt tool
brew 'youtube-dl'
brew 'awscli'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'keybase'
brew 'mycli'
brew 'scmpuff'

# Install PHP7
brew 'php71', args: ['with-debug']
brew 'php71-intl'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

link 'php71'

cask 'google-chrome'
cask 'vlc'
cask 'dropbox'
cask 'quicklook-csv'
cask 'provisionql'
cask 'quicklookapk'
cask 'qlmarkdown'
cask 'fastlane'
cask 'freeze'

# Apps
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'phpstorm'
cask 'sequel-pro'
cask 'sublime-text'
cask 'tower'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'
cask 'licecap'

# menubar utils
cask 'gitify'
cask 'caffeine'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Paw', id: 584653203
mas 'Tweetbot', id: 557168941


# laravel valet
# Audio Hijack
# Docker for Mac
# Atom
# GenyMotion
# Franz
# Knox
# Microsoft Office
# XCode
# Atom
# CleanMyMac
# VMware Fusion (Install Windows 7 Box too)
# The Unarchiver
# Sequel Pro
# Tower
# Traffic
# Transmission
# Ulysses
# Virtualbox
# Paw
# Paparazzi
# Moom
# Permute
# PCalc
# Just Press Record
# Kaleidoscope
# Docker for Mac
# Things
# GPG Keychain
# Growl
# Bowtie
# Appcelerator Studio
# Adobe Air
